module.exports.config = {
  name: "life",
  version: "1.0.0",
  permission: 0,
  credits: "King_Shourov",
  description: "লাইফ কোটস",
  prefix: true,
  category: "fun",
  usages: "",
  cooldowns: 5
};

module.exports.run = async ({ api, event }) => {
  const quotes = [
    "জীবন এক পরীক্ষার মতো, সফল হতে ধৈর্য ধরো।",
    "বিপদ আসলে ভয় পাওয়ার না, মোকাবেলা করার।",
    "যখন কেউ তোমার প্রতি অবজ্ঞা করে, তখন তুমি তার থেকে এগিয়ে যাওয়ার সুযোগ পেয়েছ।",
    "সফলতা আসে কেবল কঠোর পরিশ্রম ও বিশ্বাসের মাধ্যমে।",
    "জীবনের সবচেয়ে বড় বুদ্ধিমতা হলো কখনো হাল ছাড়তে না জানাটা।",
    "নিজেকে ভালোবাসো, কারণ তুমি একমাত্র যা পাবে সারাজীবন।",
    "অন্ধকার ছাড়াও আলো কখনো বুঝা যায় না।",
    "প্রত্যেক দিনই নতুন সম্ভাবনা নিয়ে আসে, তুমি সেই সম্ভাবনা গুলোকে কাজে লাগাও।",
    "ভুল করাটা শেখার অংশ, ভয় পেয়ে থেমে যাওয়া না।",
    "সর্বদা নিজের স্বপ্নের পেছনে লেগে থাকো, কারণ তারা তোমাকে এগিয়ে নিয়ে যাবে।",
    "জীবন এক সুন্দর উপহার, সেটাকে ভালোভাবে ব্যবহার করো।",
    "তুমি নিজেই তোমার ভাগ্য গড়ো, অন্য কেউ নয়।",
    "পরিস্থিতি যাই হোক, তোমার মনোবল হারাতে হবে না।",
    "যত কঠিনই হোক পথ, শেষ পর্যন্ত তোমার ভালো হবে।",
    "আত্মবিশ্বাস ছাড়া কোন পথ সহজ হয় না।"
  ];

  const randomQuote = quotes[Math.floor(Math.random() * quotes.length)];
  return api.sendMessage(randomQuote, event.threadID, event.messageID);
};
